[
  {
    "id": "1",
    "nom": "Refonte du portfolio",
    "imagePreview": "/images/projects/refonte_portfolio.jpg",
    "category": "Projet Personnel",
    "description": "J'ai refait mon portfolio pour le rendre plus moderne, plus dynamique et plus eco-responsable. J'ai également ajouté un dark mode pour les utilisateurs qui préfèrent les couleurs sombres.",
    "shortDescription": "Refonte de mon portfolio pour le rendre plus moderne, plus dynamique et plus eco-responsable.",
    "githubLink": "https://www.github.com/RayzerDev/portfolio",
    "competenceIds": [
      "33",
      "17"
    ]
  },
  {
    "id": "2",
    "nom": "Portfolio",
    "imagePreview": "/images/projects/20231224123810.jpg",
    "category": "Projet Personnel",
    "description": "C'est un projet personnel que j'ai développé afin de montrer mes compétences, mes projets en tant que développeur.",
    "shortDescription": "Site WEB type portfolio pour montrer mes compétences et mes projets.",
    "githubLink": "https://www.github.com/RayzerDev/PortfolioHTML",
    "competenceIds": [
      "3",
      "4",
      "6",
      "8"
    ]
  },
  {
    "id": "3",
    "nom": "PurpleOctopus",
    "imagePreview": "/images/projects/20231229104046.png",
    "category": "Projet Personnel",
    "description": "C'est l'un de mes premiers projets personnels. Il gère les membres de mon serveur Discord en y ajoutant des rôles par rapport aux jeux. Il enregistre également dans une BDD l'ID Clash Royale des membres pour visualiser les prochains coffres.",
    "shortDescription": "Gestion des membres de mon serveur Discord. Enregistrement de l'ID Clash Royale pour visualiser ses prochains coffres.",
    "githubLink": "https://github.com/RayzerDev/PurpleOctopus",
    "competenceIds": [
      "11",
      "9",
      "19"
    ]
  },
  {
    "id": "4",
    "nom": "Flatcraft",
    "imagePreview": "/images/projects/20231207221234.jpg",
    "category": "Projet Scolaire",
    "description": "Flatcraft est un jeu inspiré de Minecraft, mais en 2D. Nous devions rajouter au fur et à mesure des fonctionnalités comme la création du sous-sol, la gestion de plusieurs dimensions en utilisant des patrons de conceptions.",
    "shortDescription": "Jeu inspiré de Minecraft, mais en 2D. Rajout de fonctionnalités au fur et à mesure.",
    "githubLink": "https://github.com/RayzerDev/Flatcraft",
    "competenceIds": [
      "12"
    ]
  },
  {
    "id": "5",
    "nom": "RayTracer",
    "imagePreview": "/images/projects/20231229105812.jpg",
    "category": "Projet Scolaire",
    "description": "C'est un projet réalisé en équipe de 4 sur une semaine. Nous devions, à partir d'un fichier texte retourner une image avec un système de lumière, d'ombrage et de couleur. Le but du projet était d'implémenter des patrons de conception en Java.",
    "shortDescription": "Projet réalisé en équipe de 4 sur une semaine, sur un RayTracer en Java.",
    "githubLink": "https://github.com/RayzerDev/RayTracer",
    "competenceIds": [
      "12"
    ]
  },
  {
    "id": "6",
    "nom": "ReadMe",
    "imagePreview": "/images/projects/20231224120617.jpg",
    "category": "Projet Scolaire",
    "description": "ReadMe est un site permettant de lire des histoires dont le contenu dépend du choix du lecteur. A chaque étape, le lecteur a ainsi le choix entre plusieurs possibilités lui donnant accès à diverses suites possibles. Notre équipe “Front_2_Back”, était composée de 4 étudiants informatiques et 5 en multimédia. Nous avions 2 jours.",
    "shortDescription": "Site web pour lire des histoires dont le contenu dépend du choix du lecteur.",
    "githubLink": "https://github.com/RayzerDev/ReadMeWebSite",
    "competenceIds": [
      "7",
      "8"
    ]
  },
  {
    "id": "7",
    "nom": "RayTracer WebSite",
    "imagePreview": "/images/projects/20231229132951.jpg",
    "category": "Projet Scolaire",
    "description": "Ce projet vient en complément du RayTracer en Java. Nous devions réaliser un site web pour publier des images de RayTracer, avec la possibilité de commenter ou de noter ces images. Nous avions 2 jours en groupe de 4 pour réaliser ce site.",
    "shortDescription": "Site web pour publier des images de RayTracer, avec la possibilité de commenter ou de noter ces images.",
    "githubLink": "https://github.com/RayzerDev/RayTracer-WebSite",
    "competenceIds": [
      "7",
      "8"
    ]
  },
  {
    "id": "8",
    "nom": "NexTicket",
    "imagePreview": "/images/projects/default.jpg",
    "category": "Projet Personnel",
    "description": "Nexticket est un projet personnel de type HelpDesk que j'ai développé pour gérer des tickets d'une entreprise, notamment à des fins de maintenance. Il permet de créer des tickets, de les assigner à des membres d'une équipe selon les tags (catégories) et de les résoudre.",
    "shortDescription": "Application de type HelpDesk pour gérer des tickets d'une entreprise.",
    "githubLink": "https://github.com/RayzerDev/NexTicket",
    "competenceIds": [
      "17",
      "32",
      "25"
    ]
  },
  {
    "id": "9",
    "nom": "TicketMain",
    "imagePreview": "/images/projects/ticketmain.png",
    "category": "Projet Scolaire",
    "description": "TicketMain est un projet scolaire permettant de gérer la billetterie d'événements en ligne. Il permet de créer des événements, de les afficher, de les réserver. Il permet également de gérer les utilisateurs, les rôles et les permissions.",
    "shortDescription": "Gestion de la billetterie d'événements en ligne.",
    "githubLink": "https://github.com/RayzerDev/TicketMain-Front",
    "competenceIds": [
      "17",
      "8",
      "7",
      "24"
    ]
  },
  {
    "id": "10",
    "nom": "TicketMain Mobile",
    "imagePreview": "/images/projects/default.jpg",
    "category": "Projet Scolaire",
    "description": "Ce projet est en complément du projet TicketMain. C'est une application permettant de gérer les billets achetés par les utilisateurs. L'application permet de générer un QRCode unique pour chaque billet pour le contrôle d'accès. Elle permet également de scanner les QRCode pour vérifier l'authenticité du billet.",
    "shortDescription": "Gestion des billets achetés, et contrôle d'accès avec QRCode.",
    "githubLink": "https://github.com/RayzerDev/TicketMainMobile",
    "competenceIds": [
      "17",
      "8",
      "7",
      "34"
    ]
  },
  {
    "id": "11",
    "nom": "DriveHub (frontend)",
    "imagePreview": "/images/projects/drivehub.png",
    "category": "Projet Scolaire",
    "description": "Nous avons fait ce projet en groupe de 5 en suivant la méthode agile (Scrum Master et Product Owner). Le but était de reprendre l'API d'un autre groupe, et que celui-ci nous donne son avis sur l'état d'avancement du projet, et priorise les tickets à réaliser dans les prochains sprints d'une durée d'une heure et demie.",
    "shortDescription": "Réseau social sur les voitures.",
    "githubLink": "https://github.com/RayzerDev/DriveHub-Front",
    "competenceIds": [
      "23",
      "25",
      "37",
      "38"
    ]
  },
  {
    "id": "12",
    "nom": "Tripfolio (backend)",
    "imagePreview": "/images/projects/default.jpg",
    "category": "Projet Scolaire",
    "description": "En groupe de 5, nous avons dû réaliser une API pour un réseau social avec un système de recommandation (posts, utilisateur) et un système de génération d'images IA pour les posts ou avatars en fonction du descriptif ou des caractéristiques. L'objectif était de fournir une API documentée et maintenable pour transmettre à un autre groupe.",
    "shortDescription": "Réseau social sur les voyages.",
    "githubLink": "https://github.com/RayzerDev/Tripfolio-API",
    "competenceIds": [
      "32",
      "12",
      "13",
      "37",
      "38",
      "35",
      "36",
      "28"
    ]
  }
]